from enum import Enum


class ButtonsKeys(Enum):
    CALC            = '🔢 Рассчитать восходящий знак'
    RACHUKE         = '🌌 Прогноз по оси Раху-Кету'
    CHECK_2023      = '📆 Сверьте каким для вас был 2023'
    DATE_KNOWN      = '✅ Знаю точную дату своего рождения'
    TIME_UNKNOWN    = '❌ Пропустить'
    RETURN          = '↩️ Вернуться'
    LUCK_2023       = '🍀 Проверить тенденции моей удачи в 2023 году'
    TASKS_OPP_2024  = '🎯 Мои задачи и возможности в 2024 году'
    DETAIL_2024     = '🔍 Хочу детальный прогноз на 2024'
